MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
          </instance>
        </module>
        <module name="BSC" id="BSC" version="11072B">
          <instance name="BSC">
            <register-group address-space="base" name="BSC" name-in-module="BSC" offset="0xFFFFFE54"/>
          </instance>
        </module>
        <module name="CAN" id="CAN" version="6019N">
          <instance name="CAN0">
            <register-group address-space="base" name="CAN0" name-in-module="CAN" offset="0xF000C000"/>
            <signals>
              <signal pad="PD14" function="C" group="CANRX" index="0"/>
              <signal pad="PD15" function="C" group="CANTX" index="0"/>
            </signals>
          </instance>
          <instance name="CAN1">
            <register-group address-space="base" name="CAN1" name-in-module="CAN" offset="0xF8010000"/>
            <signals>
              <signal pad="PB14" function="B" group="CANRX" index="1"/>
              <signal pad="PB15" function="B" group="CANTX" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="DBGU" id="DBGU" version="6059M">
          <instance name="DBGU">
            <register-group address-space="base" name="DBGU" name-in-module="DBGU" offset="0xFFFFEE00"/>
            <signals>
              <signal pad="PB30" function="A" group="DRXD"/>
              <signal pad="PB31" function="A" group="DTXD"/>
            </signals>
          </instance>
        </module>
        <module name="DMAC" id="DMAC" version="6233L">
          <instance name="DMAC0">
            <register-group address-space="base" name="DMAC0" name-in-module="DMAC" offset="0xFFFFE600"/>
          </instance>
          <instance name="DMAC1">
            <register-group address-space="base" name="DMAC1" name-in-module="DMAC" offset="0xFFFFE800"/>
          </instance>
        </module>
        <module name="FUSE" id="FUSE" version="11094B">
          <instance name="FUSE">
            <register-group address-space="base" name="FUSE" name-in-module="FUSE" offset="0xFFFFE400"/>
          </instance>
        </module>
        <module name="GMAC" id="GMAC" version="11046C">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0xF0028000"/>
            <signals>
              <signal pad="PB15" function="A" group="GCOL"/>
              <signal pad="PB14" function="A" group="GCRS"/>
              <signal pad="PB16" function="A" group="GMDC"/>
              <signal pad="PB17" function="A" group="GMDIO"/>
              <signal pad="PB11" function="A" group="GRXCK"/>
              <signal pad="PB12" function="A" group="GRXDV"/>
              <signal pad="PB13" function="A" group="GRXER"/>
              <signal pad="PB4" function="A" group="GRX" index="0"/>
              <signal pad="PB5" function="A" group="GRX" index="1"/>
              <signal pad="PB6" function="A" group="GRX" index="2"/>
              <signal pad="PB7" function="A" group="GRX" index="3"/>
              <signal pad="PB23" function="B" group="GRX" index="4"/>
              <signal pad="PB24" function="B" group="GRX" index="5"/>
              <signal pad="PB25" function="B" group="GRX" index="6"/>
              <signal pad="PB26" function="B" group="GRX" index="7"/>
              <signal pad="PB8" function="A" group="GTXCK"/>
              <signal pad="PB9" function="A" group="GTXEN"/>
              <signal pad="PB10" function="A" group="GTXER"/>
              <signal pad="PB0" function="A" group="GTX" index="0"/>
              <signal pad="PB1" function="A" group="GTX" index="1"/>
              <signal pad="PB2" function="A" group="GTX" index="2"/>
              <signal pad="PB3" function="A" group="GTX" index="3"/>
              <signal pad="PB19" function="B" group="GTX" index="4"/>
              <signal pad="PB20" function="B" group="GTX" index="5"/>
              <signal pad="PB21" function="B" group="GTX" index="6"/>
              <signal pad="PB22" function="B" group="GTX" index="7"/>
              <signal pad="PB18" function="A" group="G125CK"/>
              <signal pad="PB27" function="B" group="G125CKO"/>
            </signals>
          </instance>
        </module>
        <module name="GPBR" id="GPBR" version="6378D">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0xFFFFFE60"/>
          </instance>
        </module>
        <module name="HSMCI" id="HSMCI" version="6449H">
          <instance name="HSMCI0">
            <register-group address-space="base" name="HSMCI0" name-in-module="HSMCI" offset="0xF0000000"/>
            <signals>
              <signal pad="PD0" function="A" group="MCI0_CDA"/>
              <signal pad="PD9" function="A" group="MCI0_CK"/>
              <signal pad="PD1" function="A" group="MCI0_DA" index="0"/>
              <signal pad="PD2" function="A" group="MCI0_DA" index="1"/>
              <signal pad="PD3" function="A" group="MCI0_DA" index="2"/>
              <signal pad="PD4" function="A" group="MCI0_DA" index="3"/>
              <signal pad="PD5" function="A" group="MCI0_DA" index="4"/>
              <signal pad="PD6" function="A" group="MCI0_DA" index="5"/>
              <signal pad="PD7" function="A" group="MCI0_DA" index="6"/>
              <signal pad="PD8" function="A" group="MCI0_DA" index="7"/>
            </signals>
          </instance>
          <instance name="HSMCI1">
            <register-group address-space="base" name="HSMCI1" name-in-module="HSMCI" offset="0xF8000000"/>
            <signals>
              <signal pad="PB19" function="A" group="MCI1_CDA"/>
              <signal pad="PB24" function="A" group="MCI1_CK"/>
              <signal pad="PB20" function="A" group="MCI1_DA" index="0"/>
              <signal pad="PB21" function="A" group="MCI1_DA" index="1"/>
              <signal pad="PB22" function="A" group="MCI1_DA" index="2"/>
              <signal pad="PB23" function="A" group="MCI1_DA" index="3"/>
            </signals>
          </instance>
          <instance name="HSMCI2">
            <register-group address-space="base" name="HSMCI2" name-in-module="HSMCI" offset="0xF8004000"/>
            <signals>
              <signal pad="PC10" function="A" group="MCI2_CDA"/>
              <signal pad="PC15" function="A" group="MCI2_CK"/>
              <signal pad="PC11" function="A" group="MCI2_DA" index="0"/>
              <signal pad="PC12" function="A" group="MCI2_DA" index="1"/>
              <signal pad="PC13" function="A" group="MCI2_DA" index="2"/>
              <signal pad="PC14" function="A" group="MCI2_DA" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="ISI" id="ISI" version="6350F">
          <instance name="ISI">
            <register-group address-space="base" name="ISI" name-in-module="ISI" offset="0xF0034000"/>
            <signals>
              <signal pad="PA16" function="C" group="ISI_D" index="0"/>
              <signal pad="PA17" function="C" group="ISI_D" index="1"/>
              <signal pad="PA18" function="C" group="ISI_D" index="2"/>
              <signal pad="PA19" function="C" group="ISI_D" index="3"/>
              <signal pad="PA20" function="C" group="ISI_D" index="4"/>
              <signal pad="PA21" function="C" group="ISI_D" index="5"/>
              <signal pad="PA22" function="C" group="ISI_D" index="6"/>
              <signal pad="PA23" function="C" group="ISI_D" index="7"/>
              <signal pad="PC29" function="C" group="ISI_D" index="8"/>
              <signal pad="PC28" function="C" group="ISI_D" index="9"/>
              <signal pad="PC27" function="C" group="ISI_D" index="10"/>
              <signal pad="PC26" function="C" group="ISI_D" index="11"/>
              <signal pad="PA31" function="C" group="ISI_HSYNC"/>
              <signal pad="PC30" function="C" group="ISI_PCK"/>
              <signal pad="PA30" function="C" group="ISI_VSYNC"/>
            </signals>
          </instance>
        </module>
        <module name="LCDC" id="LCDC" version="11062A">
          <instance name="LCDC">
            <register-group address-space="base" name="LCDC" name-in-module="LCDC" offset="0xF0030000"/>
            <signals>
              <signal pad="PA0" function="A" group="LCDDAT" index="0"/>
              <signal pad="PA1" function="A" group="LCDDAT" index="1"/>
              <signal pad="PA2" function="A" group="LCDDAT" index="2"/>
              <signal pad="PA3" function="A" group="LCDDAT" index="3"/>
              <signal pad="PA4" function="A" group="LCDDAT" index="4"/>
              <signal pad="PA5" function="A" group="LCDDAT" index="5"/>
              <signal pad="PA6" function="A" group="LCDDAT" index="6"/>
              <signal pad="PA7" function="A" group="LCDDAT" index="7"/>
              <signal pad="PA8" function="A" group="LCDDAT" index="8"/>
              <signal pad="PA9" function="A" group="LCDDAT" index="9"/>
              <signal pad="PA10" function="A" group="LCDDAT" index="10"/>
              <signal pad="PA11" function="A" group="LCDDAT" index="11"/>
              <signal pad="PA12" function="A" group="LCDDAT" index="12"/>
              <signal pad="PA13" function="A" group="LCDDAT" index="13"/>
              <signal pad="PA14" function="A" group="LCDDAT" index="14"/>
              <signal pad="PA15" function="A" group="LCDDAT" index="15"/>
              <signal pad="PA16" function="A" group="LCDDAT" index="16"/>
              <signal pad="PC14" function="C" group="LCDDAT" index="16"/>
              <signal pad="PA17" function="A" group="LCDDAT" index="17"/>
              <signal pad="PC13" function="C" group="LCDDAT" index="17"/>
              <signal pad="PA18" function="A" group="LCDDAT" index="18"/>
              <signal pad="PC12" function="C" group="LCDDAT" index="18"/>
              <signal pad="PA19" function="A" group="LCDDAT" index="19"/>
              <signal pad="PC11" function="C" group="LCDDAT" index="19"/>
              <signal pad="PA20" function="A" group="LCDDAT" index="20"/>
              <signal pad="PC10" function="C" group="LCDDAT" index="20"/>
              <signal pad="PA21" function="A" group="LCDDAT" index="21"/>
              <signal pad="PC15" function="C" group="LCDDAT" index="21"/>
              <signal pad="PA22" function="A" group="LCDDAT" index="22"/>
              <signal pad="PE27" function="C" group="LCDDAT" index="22"/>
              <signal pad="PA23" function="A" group="LCDDAT" index="23"/>
              <signal pad="PE28" function="C" group="LCDDAT" index="23"/>
              <signal pad="PA29" function="A" group="LCDDEN"/>
              <signal pad="PA25" function="A" group="LCDDISP"/>
              <signal pad="PA27" function="A" group="LCDHSYNC"/>
              <signal pad="PA28" function="A" group="LCDPCK"/>
              <signal pad="PA24" function="A" group="LCDPWM"/>
              <signal pad="PA26" function="A" group="LCDVSYNC"/>
            </signals>
          </instance>
        </module>
