MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="DMAC Channel Source Address Register (ch_num = 6)" name="DMAC_SADDR6" offset="0x12C" rw="RW" size="4">
          <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SADDR"/>
        </register>
        <register caption="DMAC Channel Destination Address Register (ch_num = 6)" name="DMAC_DADDR6" offset="0x130" rw="RW" size="4">
          <bitfield caption="Channel x Destination Address" mask="0xFFFFFFFF" name="DADDR"/>
        </register>
        <register caption="DMAC Channel Descriptor Address Register (ch_num = 6)" name="DMAC_DSCR6" offset="0x134" rw="RW" size="4">
          <bitfield caption="" mask="0x00000003" name="DSCR_IF" values="DMAC_DSCR6__DSCR_IF"/>
          <bitfield caption="Buffer Transfer Descriptor Address" mask="0xFFFFFFFC" name="DSCR"/>
        </register>
        <register caption="DMAC Channel Control A Register (ch_num = 6)" name="DMAC_CTRLA6" offset="0x138" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Size" mask="0x0000FFFF" name="BTSIZE"/>
          <bitfield caption="Source Chunk Transfer Size." mask="0x00070000" name="SCSIZE" values="DMAC_CTRLA6__SCSIZE"/>
          <bitfield caption="Destination Chunk Transfer Size" mask="0x00700000" name="DCSIZE" values="DMAC_CTRLA6__DCSIZE"/>
          <bitfield caption="Transfer Width for the Source" mask="0x03000000" name="SRC_WIDTH" values="DMAC_CTRLA6__SRC_WIDTH"/>
          <bitfield caption="Transfer Width for the Destination" mask="0x30000000" name="DST_WIDTH" values="DMAC_CTRLA6__DST_WIDTH"/>
          <bitfield caption="" mask="0x80000000" name="DONE"/>
        </register>
        <register caption="DMAC Channel Control B Register (ch_num = 6)" name="DMAC_CTRLB6" offset="0x13C" rw="RW" size="4">
          <bitfield caption="Source Interface Selection Field" mask="0x00000003" name="SIF" values="DMAC_CTRLB6__SIF"/>
          <bitfield caption="Destination Interface Selection Field" mask="0x00000030" name="DIF" values="DMAC_CTRLB6__DIF"/>
          <bitfield caption="Source Picture-in-Picture Mode" mask="0x00000100" name="SRC_PIP" values="DMAC_CTRLB6__SRC_PIP"/>
          <bitfield caption="Destination Picture-in-Picture Mode" mask="0x00001000" name="DST_PIP" values="DMAC_CTRLB6__DST_PIP"/>
          <bitfield caption="Source Address Descriptor" mask="0x00010000" name="SRC_DSCR" values="DMAC_CTRLB6__SRC_DSCR"/>
          <bitfield caption="Destination Address Descriptor" mask="0x00100000" name="DST_DSCR" values="DMAC_CTRLB6__DST_DSCR"/>
          <bitfield caption="Flow Control" mask="0x00E00000" name="FC" values="DMAC_CTRLB6__FC"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Source" mask="0x03000000" name="SRC_INCR" values="DMAC_CTRLB6__SRC_INCR"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Destination" mask="0x30000000" name="DST_INCR" values="DMAC_CTRLB6__DST_INCR"/>
          <bitfield caption="" mask="0x40000000" name="IEN"/>
          <bitfield caption="Automatic Multiple Buffer Transfer" mask="0x80000000" name="AUTO" values="DMAC_CTRLB6__AUTO"/>
        </register>
        <register caption="DMAC Channel Configuration Register (ch_num = 6)" name="DMAC_CFG6" offset="0x140" rw="RW" size="4">
          <bitfield caption="Source with Peripheral identifier" mask="0x0000000F" name="SRC_PER"/>
          <bitfield caption="Destination with Peripheral identifier" mask="0x000000F0" name="DST_PER"/>
          <bitfield caption="Source Reloaded from Previous" mask="0x00000100" name="SRC_REP" values="DMAC_CFG6__SRC_REP"/>
          <bitfield caption="Software or Hardware Selection for the Source" mask="0x00000200" name="SRC_H2SEL" values="DMAC_CFG6__SRC_H2SEL"/>
          <bitfield caption="SRC_PER Most Significant Bits" mask="0x00000C00" name="SRC_PER_MSB"/>
          <bitfield caption="Destination Reloaded from Previous" mask="0x00001000" name="DST_REP" values="DMAC_CFG6__DST_REP"/>
          <bitfield caption="Software or Hardware Selection for the Destination" mask="0x00002000" name="DST_H2SEL" values="DMAC_CFG6__DST_H2SEL"/>
          <bitfield caption="DST_PER Most Significant Bits" mask="0x0000C000" name="DST_PER_MSB"/>
          <bitfield caption="Stop On Done" mask="0x00010000" name="SOD" values="DMAC_CFG6__SOD"/>
          <bitfield caption="Interface Lock" mask="0x00100000" name="LOCK_IF" values="DMAC_CFG6__LOCK_IF"/>
          <bitfield caption="Bus Lock" mask="0x00200000" name="LOCK_B" values="DMAC_CFG6__LOCK_B"/>
          <bitfield caption="Master Interface Arbiter Lock" mask="0x00400000" name="LOCK_IF_L" values="DMAC_CFG6__LOCK_IF_L"/>
          <bitfield caption="AHB Protection" mask="0x07000000" name="AHB_PROT"/>
          <bitfield caption="FIFO Configuration" mask="0x30000000" name="FIFOCFG" values="DMAC_CFG6__FIFOCFG"/>
        </register>
        <register caption="DMAC Channel Source Picture-in-Picture Configuration Register (ch_num = 6)" name="DMAC_SPIP6" offset="0x144" rw="RW" size="4">
          <bitfield caption="Source Picture-in-Picture Hole" mask="0x0000FFFF" name="SPIP_HOLE"/>
          <bitfield caption="Source Picture-in-Picture Boundary" mask="0x03FF0000" name="SPIP_BOUNDARY"/>
        </register>
        <register caption="DMAC Channel Destination Picture-in-Picture Configuration Register (ch_num = 6)" name="DMAC_DPIP6" offset="0x148" rw="RW" size="4">
          <bitfield caption="Destination Picture-in-Picture Hole" mask="0x0000FFFF" name="DPIP_HOLE"/>
          <bitfield caption="Destination Picture-in-Picture Boundary" mask="0x03FF0000" name="DPIP_BOUNDARY"/>
        </register>
        <register caption="DMAC Channel Source Address Register (ch_num = 7)" name="DMAC_SADDR7" offset="0x154" rw="RW" size="4">
          <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SADDR"/>
        </register>
        <register caption="DMAC Channel Destination Address Register (ch_num = 7)" name="DMAC_DADDR7" offset="0x158" rw="RW" size="4">
          <bitfield caption="Channel x Destination Address" mask="0xFFFFFFFF" name="DADDR"/>
        </register>
