MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
      <value-group caption="" name="DMAC_CTRLA6__SRC_WIDTH">
        <value caption="the transfer size is set to 8-bit width" name="BYTE" value="0x0"/>
        <value caption="the transfer size is set to 16-bit width" name="HALF_WORD" value="0x1"/>
        <value caption="the transfer size is set to 32-bit width" name="WORD" value="0x2"/>
        <value caption="the transfer size is set to 64-bit width" name="DWORD" value="0x3"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA6__DST_WIDTH">
        <value caption="the transfer size is set to 8-bit width" name="BYTE" value="0x0"/>
        <value caption="the transfer size is set to 16-bit width" name="HALF_WORD" value="0x1"/>
        <value caption="the transfer size is set to 32-bit width" name="WORD" value="0x2"/>
        <value caption="the transfer size is set to 64-bit width" name="DWORD" value="0x3"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__SIF">
        <value caption="The source transfer is done via AHB-Lite Interface 0" name="AHB_IF0" value="0x0"/>
        <value caption="The source transfer is done via AHB-Lite Interface 1" name="AHB_IF1" value="0x1"/>
        <value caption="The source transfer is done via AHB-Lite Interface 2" name="AHB_IF2" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__DIF">
        <value caption="The destination transfer is done via AHB-Lite Interface 0" name="AHB_IF0" value="0x0"/>
        <value caption="The destination transfer is done via AHB-Lite Interface 1" name="AHB_IF1" value="0x1"/>
        <value caption="The destination transfer is done via AHB-Lite Interface 2" name="AHB_IF2" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__SRC_PIP">
        <value caption="Picture-in-Picture mode is disabled. The source data area is contiguous." name="DISABLE" value="0"/>
        <value caption="Picture-in-Picture mode is enabled. When the source PIP counter reaches the programmable boundary, the address is automatically incremented by a user defined amount." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__DST_PIP">
        <value caption="Picture-in-Picture mode is disabled. The Destination data area is contiguous." name="DISABLE" value="0"/>
        <value caption="Picture-in-Picture mode is enabled. When the Destination PIP counter reaches the programmable boundary the address is automatically incremented by a user-defined amount." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__SRC_DSCR">
        <value caption="Source address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the source." name="FETCH_DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__DST_DSCR">
        <value caption="Destination address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the destination." name="FETCH_DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__FC">
        <value caption="Memory-to-Memory Transfer DMAC is flow controller" name="MEM2MEM_DMA_FC" value="0x0"/>
        <value caption="Memory-to-Peripheral Transfer DMAC is flow controller" name="MEM2PER_DMA_FC" value="0x1"/>
        <value caption="Peripheral-to-Memory Transfer DMAC is flow controller" name="PER2MEM_DMA_FC" value="0x2"/>
        <value caption="Peripheral-to-Peripheral Transfer DMAC is flow controller" name="PER2PER_DMA_FC" value="0x3"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__SRC_INCR">
        <value caption="The source address is incremented" name="INCREMENTING" value="0x0"/>
        <value caption="The source address is decremented" name="DECREMENTING" value="0x1"/>
        <value caption="The source address remains unchanged" name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__DST_INCR">
        <value caption="The destination address is incremented" name="INCREMENTING" value="0x0"/>
        <value caption="The destination address is decremented" name="DECREMENTING" value="0x1"/>
        <value caption="The destination address remains unchanged" name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB6__AUTO">
        <value caption="Automatic multiple buffer transfer is disabled." name="DISABLE" value="0"/>
        <value caption="Automatic multiple buffer transfer is enabled. This bit enables replay mode or contiguous mode when several buffers are transferred." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG6__SRC_REP">
        <value caption="When automatic mode is activated, source address is contiguous between two buffers." name="CONTIGUOUS_ADDR" value="0"/>
        <value caption="When automatic mode is activated, the source address and the control register are reloaded from previous transfer." name="RELOAD_ADDR" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG6__SRC_H2SEL">
        <value caption="Software handshaking interface is used to trigger a transfer request." name="SW" value="0"/>
        <value caption="Hardware handshaking interface is used to trigger a transfer request." name="HW" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG6__DST_REP">
        <value caption="When automatic mode is activated, destination address is contiguous between two buffers." name="CONTIGUOUS_ADDR" value="0"/>
        <value caption="When automatic mode is activated, the destination and the control register are reloaded from the pre-vious transfer." name="RELOAD_ADDR" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG6__DST_H2SEL">
        <value caption="Software handshaking interface is used to trigger a transfer request." name="SW" value="0"/>
        <value caption="Hardware handshaking interface is used to trigger a transfer request." name="HW" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG6__SOD">
        <value caption="STOP ON DONE disabled, the descriptor fetch operation ignores DONE Field of CTRLA register." name="DISABLE" value="0"/>
        <value caption="STOP ON DONE activated, the DMAC module is automatically disabled if DONE FIELD is set to 1." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG6__LOCK_IF">
        <value caption="Interface Lock capability is disabled" name="DISABLE" value="0"/>
        <value caption="Interface Lock capability is enabled" name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG6__LOCK_B">
        <value caption="AHB Bus Locking capability is disabled." name="DISABLE" value="0"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG6__LOCK_IF_L">
        <value caption="The Master Interface Arbiter is locked by the channel x for a chunk transfer." name="CHUNK" value="0"/>
        <value caption="The Master Interface Arbiter is locked by the channel x for a buffer transfer." name="BUFFER" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG6__FIFOCFG">
        <value caption="The largest defined length AHB burst is performed on the destination AHB interface." name="ALAP_CFG" value="0x0"/>
        <value caption="When half FIFO size is available/filled, a source/destination request is serviced." name="HALF_CFG" value="0x1"/>
        <value caption="When there is enough space/data available to perform a single AHB access, then the request is serviced." name="ASAP_CFG" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_DSCR7__DSCR_IF">
        <value caption="The buffer transfer descriptor is fetched via AHB-Lite Interface 0" name="AHB_IF0" value="0x0"/>
        <value caption="The buffer transfer descriptor is fetched via AHB-Lite Interface 1" name="AHB_IF1" value="0x1"/>
        <value caption="The buffer transfer descriptor is fetched via AHB-Lite Interface 2" name="AHB_IF2" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA7__SCSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="4 data transferred" name="CHK_4" value="0x1"/>
        <value caption="8 data transferred" name="CHK_8" value="0x2"/>
        <value caption="16 data transferred" name="CHK_16" value="0x3"/>
        <value caption="32 data transferred" name="CHK_32" value="0x4"/>
        <value caption="64 data transferred" name="CHK_64" value="0x5"/>
        <value caption="128 data transferred" name="CHK_128" value="0x6"/>
        <value caption="256 data transferred" name="CHK_256" value="0x7"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA7__DCSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="4 data transferred" name="CHK_4" value="0x1"/>
        <value caption="8 data transferred" name="CHK_8" value="0x2"/>
        <value caption="16 data transferred" name="CHK_16" value="0x3"/>
        <value caption="32 data transferred" name="CHK_32" value="0x4"/>
        <value caption="64 data transferred" name="CHK_64" value="0x5"/>
        <value caption="128 data transferred" name="CHK_128" value="0x6"/>
        <value caption="256 data transferred" name="CHK_256" value="0x7"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA7__SRC_WIDTH">
        <value caption="the transfer size is set to 8-bit width" name="BYTE" value="0x0"/>
        <value caption="the transfer size is set to 16-bit width" name="HALF_WORD" value="0x1"/>
        <value caption="the transfer size is set to 32-bit width" name="WORD" value="0x2"/>
        <value caption="the transfer size is set to 64-bit width" name="DWORD" value="0x3"/>
      </value-group>
