MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="Interrupt Mask Register" name="GMAC_IMR" offset="0x030" rw="R" size="4">
          <bitfield caption="Management Frame Sent" mask="0x00000001" name="MFS"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="TX Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Transmit Under Run" mask="0x00000010" name="TUR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x00001000" name="PFNZ"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
          <bitfield caption="Pause Frame Transmitted" mask="0x00004000" name="PFTR"/>
          <bitfield caption="External Interrupt" mask="0x00008000" name="EXINT"/>
          <bitfield caption="PTP Delay Request Frame Received" mask="0x00040000" name="DRQFR"/>
          <bitfield caption="PTP Sync Frame Received" mask="0x00080000" name="SFR"/>
          <bitfield caption="PTP Delay Request Frame Transmitted" mask="0x00100000" name="DRQFT"/>
          <bitfield caption="PTP Sync Frame Transmitted" mask="0x00200000" name="SFT"/>
          <bitfield caption="PDelay Request Frame Received" mask="0x00400000" name="PDRQFR"/>
          <bitfield caption="PDelay Response Frame Received" mask="0x00800000" name="PDRSFR"/>
          <bitfield caption="PDelay Request Frame Transmitted" mask="0x01000000" name="PDRQFT"/>
          <bitfield caption="PDelay Response Frame Transmitted" mask="0x02000000" name="PDRSFT"/>
        </register>
        <register caption="PHY Maintenance Register" name="GMAC_MAN" offset="0x034" rw="RW" size="4">
          <bitfield caption="PHY Data" mask="0x0000FFFF" name="DATA"/>
          <bitfield caption="Write Ten" mask="0x00030000" name="WTN"/>
          <bitfield caption="Register Address" mask="0x007C0000" name="REGA"/>
          <bitfield caption="PHY Address" mask="0x0F800000" name="PHYA"/>
          <bitfield caption="Operation" mask="0x30000000" name="OP"/>
          <bitfield caption="Clause 22 Operation" mask="0x40000000" name="CLTTO"/>
          <bitfield caption="Write ZERO" mask="0x80000000" name="WZO"/>
        </register>
        <register caption="Received Pause Quantum Register" name="GMAC_RPQ" offset="0x038" rw="R" size="4">
          <bitfield caption="Received Pause Quantum" mask="0x0000FFFF" name="RPQ"/>
        </register>
        <register caption="Transmit Pause Quantum Register" name="GMAC_TPQ" offset="0x03C" rw="RW" size="4">
          <bitfield caption="Transmit Pause Quantum" mask="0x0000FFFF" name="TPQ"/>
        </register>
        <register caption="TX Partial Store and Forward Register" name="GMAC_TPSF" offset="0x040" rw="RW" size="4">
          <bitfield caption="tx_pbuf_addr-1:0" mask="0x00000FFF" name="TPB1ADR"/>
          <bitfield caption="Enable TX Partial Store and Forward Operation" mask="0x80000000" name="ENTXP"/>
        </register>
        <register caption="RX Partial Store and Forward Register" name="GMAC_RPSF" offset="0x044" rw="RW" size="4">
          <bitfield caption="rx_pbuf_addr-1:0" mask="0x00000FFF" name="RPB1ADR"/>
          <bitfield caption="Enable RX Partial Store and Forward Operation" mask="0x80000000" name="ENRXP"/>
        </register>
        <register caption="Hash Register Bottom [31:0]" name="GMAC_HRB" offset="0x080" rw="RW" size="4">
          <bitfield caption="Hash Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Hash Register Top [63:32]" name="GMAC_HRT" offset="0x084" rw="RW" size="4">
          <bitfield caption="Hash Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Bottom [31:0] Register" name="GMAC_SAB1" offset="0x088" rw="RW" size="4">
          <bitfield caption="Specific Address 1" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Top [47:32] Register" name="GMAC_SAT1" offset="0x08C" rw="RW" size="4">
          <bitfield caption="Specific Address 1" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 2 Bottom [31:0] Register" name="GMAC_SAB2" offset="0x090" rw="RW" size="4">
          <bitfield caption="Specific Address 2" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 2 Top [47:32] Register" name="GMAC_SAT2" offset="0x094" rw="RW" size="4">
          <bitfield caption="Specific Address 2" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 3 Bottom [31:0] Register" name="GMAC_SAB3" offset="0x098" rw="RW" size="4">
          <bitfield caption="Specific Address 3" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 3 Top [47:32] Register" name="GMAC_SAT3" offset="0x09C" rw="RW" size="4">
          <bitfield caption="Specific Address 3" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 4 Bottom [31:0] Register" name="GMAC_SAB4" offset="0x0A0" rw="RW" size="4">
          <bitfield caption="Specific Address 4" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 4 Top [47:32] Register" name="GMAC_SAT4" offset="0x0A4" rw="RW" size="4">
          <bitfield caption="Specific Address 4" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Type ID Match 1 Register 0" name="GMAC_TIDM0" offset="0xA8" rw="RW" size="4">
          <bitfield caption="Type ID Match 1" mask="0x0000FFFF" name="TID"/>
        </register>
        <register caption="Type ID Match 1 Register 1" name="GMAC_TIDM1" offset="0xAC" rw="RW" size="4">
          <bitfield caption="Type ID Match 1" mask="0x0000FFFF" name="TID"/>
        </register>
        <register caption="Type ID Match 1 Register 2" name="GMAC_TIDM2" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Type ID Match 1" mask="0x0000FFFF" name="TID"/>
        </register>
        <register caption="Type ID Match 1 Register 3" name="GMAC_TIDM3" offset="0xB4" rw="RW" size="4">
          <bitfield caption="Type ID Match 1" mask="0x0000FFFF" name="TID"/>
        </register>
        <register caption="Wake on LAN Register" name="GMAC_WOL" offset="0x0B8" rw="RW" size="4">
          <bitfield caption="ARP Request IP Address" mask="0x0000FFFF" name="IP"/>
          <bitfield caption="Magic Packet Event Enable" mask="0x00010000" name="MAG"/>
          <bitfield caption="ARP Request IP Address" mask="0x00020000" name="ARP"/>
          <bitfield caption="Specific Address Register 1 Event Enable" mask="0x00040000" name="SA1"/>
          <bitfield caption="Multicast Hash Event Enable" mask="0x00080000" name="MTI"/>
        </register>
        <register caption="IPG Stretch Register" name="GMAC_IPGS" offset="0x0BC" rw="RW" size="4">
          <bitfield caption="Frame Length" mask="0x0000FFFF" name="FL"/>
        </register>
        <register caption="Stacked VLAN Register" name="GMAC_SVLAN" offset="0x0C0" rw="RW" size="4">
          <bitfield caption="User Defined VLAN_TYPE Field" mask="0x0000FFFF" name="VLAN_TYPE"/>
          <bitfield caption="Enable Stacked VLAN Processing Mode" mask="0x80000000" name="ESVLAN"/>
        </register>
        <register caption="Transmit PFC Pause Register" name="GMAC_TPFCP" offset="0x0C4" rw="RW" size="4">
          <bitfield caption="Priority Enable Vector" mask="0x000000FF" name="PEV"/>
          <bitfield caption="Pause Quantum" mask="0x0000FF00" name="PQ"/>
        </register>
        <register caption="Specific Address 1 Mask Bottom [31:0] Register" name="GMAC_SAMB1" offset="0x0C8" rw="RW" size="4">
          <bitfield caption="Specific Address 1 Mask" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Mask Top [47:32] Register" name="GMAC_SAMT1" offset="0x0CC" rw="RW" size="4">
          <bitfield caption="Specific Address 1 Mask" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Octets Transmitted [31:0] Register" name="GMAC_OTLO" offset="0x100" rw="R" size="4">
          <bitfield caption="Transmitted Octets" mask="0xFFFFFFFF" name="TXO"/>
        </register>
        <register caption="Octets Transmitted [47:32] Register" name="GMAC_OTHI" offset="0x104" rw="R" size="4">
          <bitfield caption="Transmitted Octets" mask="0x0000FFFF" name="TXO"/>
        </register>
