MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="Screening Type1 Register Priority Queue 11" name="GMAC_ST1RPQ11" offset="0x52C" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 12" name="GMAC_ST1RPQ12" offset="0x530" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 13" name="GMAC_ST1RPQ13" offset="0x534" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 14" name="GMAC_ST1RPQ14" offset="0x538" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 15" name="GMAC_ST1RPQ15" offset="0x53C" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 0" name="GMAC_ST2RPQ0" offset="0x540" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 1" name="GMAC_ST2RPQ1" offset="0x544" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 2" name="GMAC_ST2RPQ2" offset="0x548" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 3" name="GMAC_ST2RPQ3" offset="0x54C" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 4" name="GMAC_ST2RPQ4" offset="0x550" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 5" name="GMAC_ST2RPQ5" offset="0x554" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 6" name="GMAC_ST2RPQ6" offset="0x558" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 7" name="GMAC_ST2RPQ7" offset="0x55C" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 8" name="GMAC_ST2RPQ8" offset="0x560" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 9" name="GMAC_ST2RPQ9" offset="0x564" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 10" name="GMAC_ST2RPQ10" offset="0x568" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 11" name="GMAC_ST2RPQ11" offset="0x56C" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 12" name="GMAC_ST2RPQ12" offset="0x570" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 13" name="GMAC_ST2RPQ13" offset="0x574" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 14" name="GMAC_ST2RPQ14" offset="0x578" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Screening Type2 Register Priority Queue 15" name="GMAC_ST2RPQ15" offset="0x57C" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x000000F0" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
        </register>
        <register caption="Interrupt Enable Register Priority Queue 0" name="GMAC_IERPQ0" offset="0x600" rw="W" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
