MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="ISI Interrupt Disable Register" name="ISI_IDR" offset="0x30" rw="W" size="4">
          <bitfield caption="Disable Done Interrupt Disable" mask="0x00000002" name="DIS_DONE"/>
          <bitfield caption="Software Reset Interrupt Disable" mask="0x00000004" name="SRST"/>
          <bitfield caption="Vertical Synchronization Interrupt Disable" mask="0x00000400" name="VSYNC"/>
          <bitfield caption="Preview DMA Transfer Done Interrupt Disable" mask="0x00010000" name="PXFR_DONE"/>
          <bitfield caption="Codec DMA Transfer Done Interrupt Disable" mask="0x00020000" name="CXFR_DONE"/>
          <bitfield caption="Preview Datapath Overflow Interrupt Disable" mask="0x01000000" name="P_OVR"/>
          <bitfield caption="Codec Datapath Overflow Interrupt Disable" mask="0x02000000" name="C_OVR"/>
          <bitfield caption="Embedded Synchronization CRC Error Interrupt Disable" mask="0x04000000" name="CRC_ERR"/>
          <bitfield caption="Frame Rate Overflow Interrupt Disable" mask="0x08000000" name="FR_OVR"/>
        </register>
        <register caption="ISI Interrupt Mask Register" name="ISI_IMR" offset="0x34" rw="R" size="4">
          <bitfield caption="Module Disable Operation Completed" mask="0x00000002" name="DIS_DONE"/>
          <bitfield caption="Software Reset Completed" mask="0x00000004" name="SRST"/>
          <bitfield caption="Vertical Synchronization" mask="0x00000400" name="VSYNC"/>
          <bitfield caption="Preview DMA Transfer Interrupt" mask="0x00010000" name="PXFR_DONE"/>
          <bitfield caption="Codec DMA Transfer Interrupt" mask="0x00020000" name="CXFR_DONE"/>
          <bitfield caption="FIFO Preview Overflow" mask="0x01000000" name="P_OVR"/>
          <bitfield caption="FIFO Codec Overflow" mask="0x02000000" name="C_OVR"/>
          <bitfield caption="CRC Synchronization Error" mask="0x04000000" name="CRC_ERR"/>
          <bitfield caption="Frame Rate Overrun" mask="0x08000000" name="FR_OVR"/>
        </register>
        <register caption="DMA Channel Enable Register" name="ISI_DMA_CHER" offset="0x38" rw="W" size="4">
          <bitfield caption="Preview Channel Enable" mask="0x00000001" name="P_CH_EN"/>
          <bitfield caption="Codec Channel Enable" mask="0x00000002" name="C_CH_EN"/>
        </register>
        <register caption="DMA Channel Disable Register" name="ISI_DMA_CHDR" offset="0x3C" rw="W" size="4">
          <bitfield caption="" mask="0x00000001" name="P_CH_DIS"/>
          <bitfield caption="" mask="0x00000002" name="C_CH_DIS"/>
        </register>
        <register caption="DMA Channel Status Register" name="ISI_DMA_CHSR" offset="0x40" rw="R" size="4">
          <bitfield caption="" mask="0x00000001" name="P_CH_S"/>
          <bitfield caption="" mask="0x00000002" name="C_CH_S"/>
        </register>
        <register caption="DMA Preview Base Address Register" name="ISI_DMA_P_ADDR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Preview Image Base Address. (This address is word aligned.)" mask="0xFFFFFFFC" name="P_ADDR"/>
        </register>
        <register caption="DMA Preview Control Register" name="ISI_DMA_P_CTRL" offset="0x48" rw="RW" size="4">
          <bitfield caption="Descriptor Fetch Control Field" mask="0x00000001" name="P_FETCH"/>
          <bitfield caption="Descriptor Writeback Control Field" mask="0x00000002" name="P_WB"/>
          <bitfield caption="Transfer Done Flag Control" mask="0x00000004" name="P_IEN"/>
          <bitfield caption="(This field is only updated in the memory.)" mask="0x00000008" name="P_DONE"/>
        </register>
        <register caption="DMA Preview Descriptor Address Register" name="ISI_DMA_P_DSCR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Preview Descriptor Base Address (This address is word aligned.)" mask="0xFFFFFFFC" name="P_DSCR"/>
        </register>
        <register caption="DMA Codec Base Address Register" name="ISI_DMA_C_ADDR" offset="0x50" rw="RW" size="4">
          <bitfield caption="Codec Image Base Address (This address is word aligned.)" mask="0xFFFFFFFC" name="C_ADDR"/>
        </register>
        <register caption="DMA Codec Control Register" name="ISI_DMA_C_CTRL" offset="0x54" rw="RW" size="4">
          <bitfield caption="Descriptor Fetch Control Field" mask="0x00000001" name="C_FETCH"/>
          <bitfield caption="Descriptor Writeback Control Field" mask="0x00000002" name="C_WB"/>
          <bitfield caption="Transfer Done flag control" mask="0x00000004" name="C_IEN"/>
          <bitfield caption="(This field is only updated in the memory.)" mask="0x00000008" name="C_DONE"/>
        </register>
        <register caption="DMA Codec Descriptor Address Register" name="ISI_DMA_C_DSCR" offset="0x58" rw="RW" size="4">
          <bitfield caption="Codec Descriptor Base Address (This address is word aligned.)" mask="0xFFFFFFFC" name="C_DSCR"/>
        </register>
        <register caption="Write Protection Control Register" name="ISI_WPCR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WP_EN"/>
          <bitfield caption="Write Protection KEY Password" mask="0xFFFFFF00" name="WP_KEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ISI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x0000000F" name="WP_VS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WP_VSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="ISI_CFG1__THMASK">
        <value caption="Only 4 beats AHB burst allowed" name="BEATS_4" value="0x0"/>
        <value caption="Only 4 and 8 beats AHB burst allowed" name="BEATS_8" value="0x1"/>
        <value caption="4, 8 and 16 beats AHB burst allowed" name="BEATS_16" value="0x2"/>
      </value-group>
    </module>
    <module caption="LCD Controller" name="LCDC" version="11062A">
      <register-group name="LCDC">
        <register caption="LCD Controller Configuration Register 0" name="LCDC_LCDCFG0" offset="0x00000000" rw="RW" size="4">
          <bitfield caption="LCD Controller Clock Polarity" mask="0x00000001" name="CLKPOL"/>
          <bitfield caption="LCD Controller Clock Source Selection" mask="0x00000004" name="CLKSEL"/>
          <bitfield caption="LCD Controller PWM Clock Source Selection" mask="0x00000008" name="CLKPWMSEL"/>
          <bitfield caption="Clock Gating Disable Control for the Base Layer" mask="0x00000100" name="CGDISBASE"/>
          <bitfield caption="Clock Gating Disable Control for the Overlay 1 Layer" mask="0x00000200" name="CGDISOVR1"/>
          <bitfield caption="Clock Gating Disable Control for the Overlay 2 Layer" mask="0x00000400" name="CGDISOVR2"/>
          <bitfield caption="Clock Gating Disable Control for the High End Overlay" mask="0x00000800" name="CGDISHEO"/>
          <bitfield caption="Clock Gating Disable Control for the Hardware Cursor Layer" mask="0x00001000" name="CGDISHCR"/>
          <bitfield caption="Clock Gating Disable Control for the Post Processing Layer" mask="0x00002000" name="CGDISPP"/>
          <bitfield caption="LCD Controller Clock Divider" mask="0x00FF0000" name="CLKDIV"/>
        </register>
        <register caption="LCD Controller Configuration Register 1" name="LCDC_LCDCFG1" offset="0x00000004" rw="RW" size="4">
          <bitfield caption="Horizontal Synchronization Pulse Width" mask="0x0000003F" name="HSPW"/>
          <bitfield caption="Vertical Synchronization Pulse Width" mask="0x003F0000" name="VSPW"/>
        </register>
