MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="High-End Overlay U DMA Head Register" name="LCDC_HEOUHEAD" offset="0x0000036C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFF" name="UHEAD"/>
        </register>
        <register caption="High-End Overlay U DMA Address Register" name="LCDC_HEOUADDR" offset="0x00000370" rw="RW" size="4">
          <bitfield caption="DMA Transfer Start Address for U or UV Chrominance" mask="0xFFFFFFFF" name="UADDR"/>
        </register>
        <register caption="High-End Overlay U DMA control Register" name="LCDC_HEOUCTRL" offset="0x00000374" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="UDFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="UDMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="UDSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="UADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="UDONEIEN"/>
        </register>
        <register caption="High-End Overlay U DMA Next Register" name="LCDC_HEOUNEXT" offset="0x00000378" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="UNEXT"/>
        </register>
        <register caption="High-End Overlay V DMA Head Register" name="LCDC_HEOVHEAD" offset="0x0000037C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFF" name="VHEAD"/>
        </register>
        <register caption="High-End Overlay V DMA Address Register" name="LCDC_HEOVADDR" offset="0x00000380" rw="RW" size="4">
          <bitfield caption="DMA Transfer Start Address for V Chrominance" mask="0xFFFFFFFF" name="VADDR"/>
        </register>
        <register caption="High-End Overlay V DMA control Register" name="LCDC_HEOVCTRL" offset="0x00000384" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="VDFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="VDMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="VDSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="VADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="VDONEIEN"/>
        </register>
        <register caption="High-End Overlay VDMA Next Register" name="LCDC_HEOVNEXT" offset="0x00000388" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="VNEXT"/>
        </register>
        <register caption="High-End Overlay Configuration Register 0" name="LCDC_HEOCFG0" offset="0x0000038C" rw="RW" size="4">
          <bitfield caption="Source Interface" mask="0x00000001" name="SIF"/>
          <bitfield caption="AHB Burst Length" mask="0x00000030" name="BLEN" values="LCDC_HEOCFG0__BLEN"/>
          <bitfield caption="AHB Burst Length for U-V channel" mask="0x000000C0" name="BLENUV" values="LCDC_HEOCFG0__BLENUV"/>
          <bitfield caption="Defined Length Burst Only For Channel Bus Transaction." mask="0x00000100" name="DLBO"/>
          <bitfield caption="Hardware Rotation Optimization Disable" mask="0x00001000" name="ROTDIS"/>
          <bitfield caption="Hardware Rotation Lock Disable" mask="0x00002000" name="LOCKDIS"/>
        </register>
        <register caption="High-End Overlay Configuration Register 1" name="LCDC_HEOCFG1" offset="0x00000390" rw="RW" size="4">
          <bitfield caption="Color Lookup Table Enable" mask="0x00000001" name="CLUTEN"/>
          <bitfield caption="YUV Color Space Enable" mask="0x00000002" name="YUVEN"/>
          <bitfield caption="RGB input mode selection" mask="0x000000F0" name="RGBMODE" values="LCDC_HEOCFG1__RGBMODE"/>
          <bitfield caption="Color Lookup table input mode selection" mask="0x00000300" name="CLUTMODE" values="LCDC_HEOCFG1__CLUTMODE"/>
          <bitfield caption="YUV input mode selection" mask="0x0000F000" name="YUVMODE" values="LCDC_HEOCFG1__YUVMODE"/>
          <bitfield caption="YUV 4:2:2 Rotation" mask="0x00010000" name="YUV422ROT"/>
          <bitfield caption="YUV 4:2:2 SWAP" mask="0x00020000" name="YUV422SWP"/>
          <bitfield caption="Down Scaling Bandwidth Optimization" mask="0x00100000" name="DSCALEOPT"/>
        </register>
        <register caption="High-End Overlay Configuration Register 2" name="LCDC_HEOCFG2" offset="0x00000394" rw="RW" size="4">
          <bitfield caption="Horizontal Window Position" mask="0x000007FF" name="XPOS"/>
          <bitfield caption="Vertical Window Position" mask="0x07FF0000" name="YPOS"/>
        </register>
        <register caption="High-End Overlay Configuration Register 3" name="LCDC_HEOCFG3" offset="0x00000398" rw="RW" size="4">
          <bitfield caption="Horizontal Window Size" mask="0x000007FF" name="XSIZE"/>
          <bitfield caption="Vertical Window Size" mask="0x07FF0000" name="YSIZE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 4" name="LCDC_HEOCFG4" offset="0x0000039C" rw="RW" size="4">
          <bitfield caption="Horizontal image Size in Memory" mask="0x000007FF" name="XMEM_SIZE"/>
          <bitfield caption="Vertical image Size in Memory" mask="0x07FF0000" name="YMEM_SIZE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 5" name="LCDC_HEOCFG5" offset="0x000003A0" rw="RW" size="4">
          <bitfield caption="Horizontal Stride" mask="0xFFFFFFFF" name="XSTRIDE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 6" name="LCDC_HEOCFG6" offset="0x000003A4" rw="RW" size="4">
          <bitfield caption="Pixel Stride" mask="0xFFFFFFFF" name="PSTRIDE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 7" name="LCDC_HEOCFG7" offset="0x000003A8" rw="RW" size="4">
          <bitfield caption="UV Horizontal Stride" mask="0xFFFFFFFF" name="UVXSTRIDE"/>
        </register>
