MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="High-End Overlay Configuration Register 8" name="LCDC_HEOCFG8" offset="0x000003AC" rw="RW" size="4">
          <bitfield caption="UV Pixel Stride" mask="0xFFFFFFFF" name="UVPSTRIDE"/>
        </register>
        <register caption="High-End Overlay Configuration Register 9" name="LCDC_HEOCFG9" offset="0x000003B0" rw="RW" size="4">
          <bitfield caption="Blue Default" mask="0x000000FF" name="BDEF"/>
          <bitfield caption="Green Default" mask="0x0000FF00" name="GDEF"/>
          <bitfield caption="Red Default" mask="0x00FF0000" name="RDEF"/>
        </register>
        <register caption="High-End Overlay Configuration Register 10" name="LCDC_HEOCFG10" offset="0x000003B4" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key" mask="0x000000FF" name="BKEY"/>
          <bitfield caption="Green Color Component Chroma Key" mask="0x0000FF00" name="GKEY"/>
          <bitfield caption="Red Color Component Chroma Key" mask="0x00FF0000" name="RKEY"/>
        </register>
        <register caption="High-End Overlay Configuration Register 11" name="LCDC_HEOCFG11" offset="0x000003B8" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key Mask" mask="0x000000FF" name="BMASK"/>
          <bitfield caption="Green Color Component Chroma Key Mask" mask="0x0000FF00" name="GMASK"/>
          <bitfield caption="Red Color Component Chroma Key Mask" mask="0x00FF0000" name="RMASK"/>
        </register>
        <register caption="High-End Overlay Configuration Register 12" name="LCDC_HEOCFG12" offset="0x000003BC" rw="RW" size="4">
          <bitfield caption="Blender Chroma Key Enable" mask="0x00000001" name="CRKEY"/>
          <bitfield caption="Blender Inverted Blender Output Enable" mask="0x00000002" name="INV"/>
          <bitfield caption="Blender Iterated Color Enable" mask="0x00000004" name="ITER2BL"/>
          <bitfield caption="Blender Use Iterated Color" mask="0x00000008" name="ITER"/>
          <bitfield caption="Blender Reverse Alpha" mask="0x00000010" name="REVALPHA"/>
          <bitfield caption="Blender Global Alpha Enable" mask="0x00000020" name="GAEN"/>
          <bitfield caption="Blender Local Alpha Enable" mask="0x00000040" name="LAEN"/>
          <bitfield caption="Blender Overlay Layer Enable" mask="0x00000080" name="OVR"/>
          <bitfield caption="Blender DMA Layer Enable" mask="0x00000100" name="DMA"/>
          <bitfield caption="Use Replication logic to expand RGB color to 24 bits" mask="0x00000200" name="REP"/>
          <bitfield caption="Destination Chroma Keying" mask="0x00000400" name="DSTKEY"/>
          <bitfield caption="Video Priority" mask="0x00001000" name="VIDPRI"/>
          <bitfield caption="Blender Global Alpha" mask="0x00FF0000" name="GA"/>
        </register>
        <register caption="High-End Overlay Configuration Register 13" name="LCDC_HEOCFG13" offset="0x000003C0" rw="RW" size="4">
          <bitfield caption="Horizontal Scaling Factor" mask="0x00003FFF" name="XFACTOR"/>
          <bitfield caption="Vertical Scaling Factor" mask="0x3FFF0000" name="YFACTOR"/>
          <bitfield caption="Hardware Scaler Enable" mask="0x80000000" name="SCALEN"/>
        </register>
        <register caption="High-End Overlay Configuration Register 14" name="LCDC_HEOCFG14" offset="0x000003C4" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Y coefficient for Red Component 1:2:7 format" mask="0x000003FF" name="CSCRY"/>
          <bitfield caption="Color Space Conversion U coefficient for Red Component 1:2:7 format" mask="0x000FFC00" name="CSCRU"/>
          <bitfield caption="Color Space Conversion V coefficient for Red Component 1:2:7 format" mask="0x3FF00000" name="CSCRV"/>
          <bitfield caption="Color Space Conversion Offset" mask="0x40000000" name="CSCYOFF"/>
        </register>
        <register caption="High-End Overlay Configuration Register 15" name="LCDC_HEOCFG15" offset="0x000003C8" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Y coefficient for Green Component 1:2:7 format" mask="0x000003FF" name="CSCGY"/>
          <bitfield caption="Color Space Conversion U coefficient for Green Component 1:2:7 format" mask="0x000FFC00" name="CSCGU"/>
          <bitfield caption="Color Space Conversion V coefficient for Green Component 1:2:7 format" mask="0x3FF00000" name="CSCGV"/>
          <bitfield caption="Color Space Conversion Offset" mask="0x40000000" name="CSCUOFF"/>
        </register>
        <register caption="High-End Overlay Configuration Register 16" name="LCDC_HEOCFG16" offset="0x000003CC" rw="RW" size="4">
          <bitfield caption="Color Space Conversion Y coefficient for Blue Component 1:2:7 format" mask="0x000003FF" name="CSCBY"/>
          <bitfield caption="Color Space Conversion U coefficient for Blue Component 1:2:7 format" mask="0x000FFC00" name="CSCBU"/>
          <bitfield caption="Color Space Conversion V coefficient for Blue Component 1:2:7 format" mask="0x3FF00000" name="CSCBV"/>
          <bitfield caption="Color Space Conversion Offset" mask="0x40000000" name="CSCVOFF"/>
        </register>
        <register caption="High-End Overlay Configuration Register 17" name="LCDC_HEOCFG17" offset="0x000003D0" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 0 tap 0" mask="0x000000FF" name="XPHI0COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 0 tap 1" mask="0x0000FF00" name="XPHI0COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 0 tap 2" mask="0x00FF0000" name="XPHI0COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 0 tap 3" mask="0xFF000000" name="XPHI0COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 18" name="LCDC_HEOCFG18" offset="0x000003D4" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 0 tap 4" mask="0x000000FF" name="XPHI0COEFF4"/>
        </register>
        <register caption="High-End Overlay Configuration Register 19" name="LCDC_HEOCFG19" offset="0x000003D8" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 1 tap 0" mask="0x000000FF" name="XPHI1COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 1 tap 1" mask="0x0000FF00" name="XPHI1COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 1 tap 2" mask="0x00FF0000" name="XPHI1COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 1 tap 3" mask="0xFF000000" name="XPHI1COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 20" name="LCDC_HEOCFG20" offset="0x000003DC" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 1 tap 4" mask="0x000000FF" name="XPHI1COEFF4"/>
        </register>
        <register caption="High-End Overlay Configuration Register 21" name="LCDC_HEOCFG21" offset="0x000003E0" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 2 tap 0" mask="0x000000FF" name="XPHI2COEFF0"/>
          <bitfield caption="Horizontal Coefficient for phase 2 tap 1" mask="0x0000FF00" name="XPHI2COEFF1"/>
          <bitfield caption="Horizontal Coefficient for phase 2 tap 2" mask="0x00FF0000" name="XPHI2COEFF2"/>
          <bitfield caption="Horizontal Coefficient for phase 2 tap 3" mask="0xFF000000" name="XPHI2COEFF3"/>
        </register>
        <register caption="High-End Overlay Configuration Register 22" name="LCDC_HEOCFG22" offset="0x000003E4" rw="RW" size="4">
          <bitfield caption="Horizontal Coefficient for phase 2 tap 4" mask="0x000000FF" name="XPHI2COEFF4"/>
        </register>
