MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="Special Function Register 5" name="MATRIX_SFR5" offset="0x124" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 6" name="MATRIX_SFR6" offset="0x128" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 7" name="MATRIX_SFR7" offset="0x12C" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 8" name="MATRIX_SFR8" offset="0x130" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 9" name="MATRIX_SFR9" offset="0x134" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 10" name="MATRIX_SFR10" offset="0x138" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 11" name="MATRIX_SFR11" offset="0x13C" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 12" name="MATRIX_SFR12" offset="0x140" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 13" name="MATRIX_SFR13" offset="0x144" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 14" name="MATRIX_SFR14" offset="0x148" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Special Function Register 15" name="MATRIX_SFR15" offset="0x14C" rw="RW" size="4">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Write Protect Mode Register" name="MATRIX_WPMR" offset="0x01E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY (Write-only)" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="MATRIX_WPSR" offset="0x01E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
    </module>
    <module caption="AHB Multi-port DDR-SDRAM Controller" name="MPDDRC" version="11043C">
      <register-group name="MPDDRC">
        <register caption="MPDDRC Mode Register" name="MPDDRC_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="MPDDRC Command Mode" mask="0x00000007" name="MODE" values="MPDDRC_MR__MODE"/>
          <bitfield caption="Mode Register Select LPDDR2" mask="0x0000FF00" name="MRS"/>
        </register>
        <register caption="MPDDRC Refresh Timer Register" name="MPDDRC_RTR" offset="0x04" rw="RW" size="4">
          <bitfield caption="MPDDRC Refresh Timer Count" mask="0x00000FFF" name="COUNT"/>
          <bitfield caption="Adjust Refresh Rate" mask="0x00010000" name="ADJ_REF"/>
          <bitfield caption="Refresh Per Bank" mask="0x00020000" name="REF_PB"/>
          <bitfield caption="Content of MR4 Register" mask="0x00700000" name="MR4_VALUE"/>
        </register>
        <register caption="MPDDRC Configuration Register" name="MPDDRC_CR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Number of Column Bits." mask="0x00000003" name="NC" values="MPDDRC_CR__NC"/>
          <bitfield caption="Number of Row Bits" mask="0x0000000C" name="NR" values="MPDDRC_CR__NR"/>
          <bitfield caption="CAS Latency" mask="0x00000070" name="CAS" values="MPDDRC_CR__CAS"/>
          <bitfield caption="Reset DLL" mask="0x00000080" name="DLL" values="MPDDRC_CR__DLL"/>
          <bitfield caption="Output Driver Impedance Control (Drive Strength)" mask="0x00000100" name="DIC_DS"/>
          <bitfield caption="DISABLE DLL" mask="0x00000200" name="DIS_DLL"/>
          <bitfield caption="ZQ Calibration" mask="0x00000C00" name="ZQ" values="MPDDRC_CR__ZQ"/>
          <bitfield caption="Off-chip Driver" mask="0x00007000" name="OCD"/>
          <bitfield caption="Mask Data is Shared" mask="0x00010000" name="DQMS" values="MPDDRC_CR__DQMS"/>
          <bitfield caption="Enable Read Measure" mask="0x00020000" name="ENRDM" values="MPDDRC_CR__ENRDM"/>
          <bitfield caption="Number of Banks." mask="0x00100000" name="NB" values="MPDDRC_CR__NB"/>
          <bitfield caption="Not DQS:" mask="0x00200000" name="NDQS" values="MPDDRC_CR__NDQS"/>
          <bitfield caption="Type of Decoding" mask="0x00400000" name="DECOD"/>
          <bitfield caption="Support Unaligned Access" mask="0x00800000" name="UNAL" values="MPDDRC_CR__UNAL"/>
        </register>
        <register caption="MPDDRC Timing Parameter 0 Register" name="MPDDRC_TPR0" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Active to Precharge Delay" mask="0x0000000F" name="TRAS"/>
          <bitfield caption="Row to Column Delay" mask="0x000000F0" name="TRCD"/>
          <bitfield caption="Write Recovery Delay" mask="0x00000F00" name="TWR"/>
          <bitfield caption="Row Cycle Delay" mask="0x0000F000" name="TRC"/>
          <bitfield caption="Row Precharge Delay" mask="0x000F0000" name="TRP"/>
          <bitfield caption="Active BankA to Active BankB" mask="0x00F00000" name="TRRD"/>
          <bitfield caption="Internal Write to Read Delay" mask="0x0F000000" name="TWTR"/>
          <bitfield caption="Load Mode Register Command to Activate or Refresh Command" mask="0xF0000000" name="TMRD"/>
        </register>
        <register caption="MPDDRC Timing Parameter 1 Register" name="MPDDRC_TPR1" offset="0x10" rw="RW" size="4">
          <bitfield caption="Row Cycle Delay" mask="0x0000001F" name="TRFC"/>
          <bitfield caption="Exit Self Refresh Delay to Non Read Command" mask="0x0000FF00" name="TXSNR"/>
          <bitfield caption="Exit Self Refresh Delay to Read Command" mask="0x00FF0000" name="TXSRD"/>
          <bitfield caption="Exit Power-down Delay to First Command" mask="0x0F000000" name="TXP"/>
        </register>
        <register caption="MPDDRC Timing Parameter 2 Register" name="MPDDRC_TPR2" offset="0x14" rw="RW" size="4">
          <bitfield caption="Exit Active Power Down Delay to Read Command in Mode &quot;Fast Exit&quot;." mask="0x0000000F" name="TXARD"/>
          <bitfield caption="Exit Active Power Down Delay to Read Command in Mode &quot;Slow Exit&quot;." mask="0x000000F0" name="TXARDS"/>
          <bitfield caption="Row Precharge All Delay" mask="0x00000F00" name="TRPA"/>
          <bitfield caption="Read to Precharge" mask="0x00007000" name="TRTP"/>
          <bitfield caption="Four Active Windows" mask="0x000F0000" name="TFAW"/>
        </register>
