MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
      <value-group caption="" name="PIO_DRIVER1__LINE2">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE3">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE4">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE5">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE6">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE7">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE8">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE9">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE10">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE11">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE12">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE13">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE14">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER1__LINE15">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE16">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE17">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE18">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE19">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE20">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE21">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE22">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE23">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE24">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE25">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER2__LINE26">
        <value caption="Low drive" name="LO_DRIVE" value="0x0"/>
        <value caption="Medium drive" name="ME_DRIVE" value="0x2"/>
        <value caption="High drive" name="HI_DRIVE" value="0x3"/>
      </value-group>
