MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="Peripheral Clock Status Register 0" name="PMC_PCSR0" offset="0x0018" rw="R" size="4">
          <bitfield caption="Peripheral Clock 2 Status" mask="0x00000004" name="PID2"/>
          <bitfield caption="Peripheral Clock 3 Status" mask="0x00000008" name="PID3"/>
          <bitfield caption="Peripheral Clock 4 Status" mask="0x00000010" name="PID4"/>
          <bitfield caption="Peripheral Clock 5 Status" mask="0x00000020" name="PID5"/>
          <bitfield caption="Peripheral Clock 6 Status" mask="0x00000040" name="PID6"/>
          <bitfield caption="Peripheral Clock 7 Status" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral Clock 8 Status" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral Clock 9 Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Status" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Status" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Status" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 16 Status" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral Clock 17 Status" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral Clock 18 Status" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral Clock 19 Status" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Status" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 21 Status" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral Clock 22 Status" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral Clock 23 Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Status" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Status" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Status" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Status" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral Clock 31 Status" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="UTMI Clock Register" name="CKGR_UCKR" offset="0x001C" rw="RW" size="4">
          <bitfield caption="UTMI PLL Enable" mask="0x00010000" name="UPLLEN"/>
          <bitfield caption="UTMI PLL Start-up Time" mask="0x00F00000" name="UPLLCOUNT"/>
          <bitfield caption="UTMI BIAS Enable" mask="0x01000000" name="BIASEN"/>
          <bitfield caption="UTMI BIAS Start-up Time" mask="0xF0000000" name="BIASCOUNT"/>
        </register>
        <register caption="Main Oscillator Register" name="CKGR_MOR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Main Crystal Oscillator Enable" mask="0x00000001" name="MOSCXTEN"/>
          <bitfield caption="Main Crystal Oscillator Bypass" mask="0x00000002" name="MOSCXTBY"/>
          <bitfield caption="Main On-Chip RC Oscillator Enable" mask="0x00000008" name="MOSCRCEN"/>
          <bitfield caption="Main Crystal Oscillator Start-up Time" mask="0x0000FF00" name="MOSCXTST"/>
          <bitfield caption="Password" mask="0x00FF0000" name="KEY"/>
          <bitfield caption="Main Oscillator Selection" mask="0x01000000" name="MOSCSEL"/>
          <bitfield caption="Clock Failure Detector Enable" mask="0x02000000" name="CFDEN"/>
        </register>
        <register caption="Main Clock Frequency Register" name="CKGR_MCFR" offset="0x0024" rw="R" size="4">
          <bitfield caption="Main Clock Frequency" mask="0x0000FFFF" name="MAINF"/>
          <bitfield caption="Main Clock Ready" mask="0x00010000" name="MAINFRDY"/>
        </register>
        <register caption="PLLA Register" name="CKGR_PLLAR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Divider A" mask="0x000000FF" name="DIVA"/>
          <bitfield caption="PLLA Counter" mask="0x00003F00" name="PLLACOUNT"/>
          <bitfield caption="PLLA Clock Frequency Range" mask="0x0000C000" name="OUTA"/>
          <bitfield caption="PLLA Multiplier" mask="0x07FF0000" name="MULA"/>
          <bitfield mask="0x20000000" name="STUCKTO1"/>
        </register>
        <register caption="Master Clock Register" name="PMC_MCKR" offset="0x0030" rw="RW" size="4">
          <bitfield caption="Master/Processor Clock Source Selection" mask="0x00000003" name="CSS" values="PMC_MCKR__CSS"/>
          <bitfield caption="Master/Processor Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_MCKR__PRES"/>
          <bitfield caption="Master Clock Division" mask="0x00000300" name="MDIV" values="PMC_MCKR__MDIV"/>
          <bitfield caption="PLLA divisor by 2" mask="0x00001000" name="PLLADIV2" values="PMC_MCKR__PLLADIV2"/>
        </register>
        <register caption="USB Clock Register" name="PMC_USB" offset="0x0038" rw="RW" size="4">
          <bitfield caption="USB OHCI Input Clock Selection" mask="0x00000001" name="USBS"/>
          <bitfield caption="Divider for USB OHCI Clock." mask="0x00000F00" name="USBDIV"/>
        </register>
        <register caption="Soft Modem Clock Register" name="PMC_SMD" offset="0x003C" rw="RW" size="4">
          <bitfield caption="SMD input clock selection" mask="0x00000001" name="SMDS"/>
          <bitfield caption="Divider for SMD Clock." mask="0x00001F00" name="SMDDIV"/>
        </register>
