MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="Peripheral Clock Status Register 1" name="PMC_PCSR1" offset="0x00108" rw="R" size="4">
          <bitfield caption="Peripheral Clock 32 Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Status" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Status" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Status" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Status" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Status" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Status" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Status" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Status" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Status" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Status" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Status" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 46 Status" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral Clock 47 Status" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral Clock 48 Status" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral Clock 49 Status" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral Clock 50 Status" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral Clock 51 Status" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral Clock 53 Status" mask="0x00300000" name="PID53"/>
          <bitfield caption="Peripheral Clock 54 Status" mask="0x00400000" name="PID54"/>
          <bitfield caption="Peripheral Clock 55 Status" mask="0x00800000" name="PID55"/>
          <bitfield caption="Peripheral Clock 56 Status" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral Clock 57 Status" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral Clock 58 Status" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral Clock 59 Status" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral Clock 60 Status" mask="0x10000000" name="PID60"/>
          <bitfield caption="Peripheral Clock 61 Status" mask="0x20000000" name="PID61"/>
          <bitfield caption="Peripheral Clock 62 Status" mask="0x40000000" name="PID62"/>
          <bitfield caption="Peripheral Clock 63 Status" mask="0x80000000" name="PID63"/>
        </register>
        <register caption="Peripheral Control Register" name="PMC_PCR" offset="0x010C" rw="RW" size="4">
          <bitfield caption="Peripheral ID" mask="0x0000003F" name="PID"/>
          <bitfield caption="Command" mask="0x00001000" name="CMD"/>
          <bitfield caption="Divisor Value" mask="0x00030000" name="DIV" values="PMC_PCR__DIV"/>
          <bitfield caption="Enable" mask="0x10000000" name="EN"/>
        </register>
      </register-group>
      <value-group caption="" name="PMC_MCKR__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK/PLLADIV2 is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__PRES">
        <value caption="Selected clock" name="CLOCK" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLOCK_DIV2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLOCK_DIV4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLOCK_DIV8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLOCK_DIV16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLOCK_DIV32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLOCK_DIV64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__MDIV">
        <value caption="Master Clock is Prescaler Output Clock divided by 1.Warning: SysClk DDR and DDRCK are not available." name="EQ_PCK" value="0x0"/>
        <value caption="Master Clock is Prescaler Output Clock divided by 2.SysClk DDR is equal to 2 x MCK. DDRCK is equal to MCK." name="PCK_DIV2" value="0x1"/>
        <value caption="Master Clock is Prescaler Output Clock divided by 4.SysClk DDR is equal to 2 x MCK. DDRCK is equal to MCK." name="PCK_DIV4" value="0x2"/>
        <value caption="Master Clock is Prescaler Output Clock divided by 3.SysClk DDR is equal to 2 x MCK. DDRCK is equal to MCK." name="PCK_DIV3" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__PLLADIV2">
        <value caption="PLLA clock frequency is divided by 1." name="NOT_DIV2" value="0"/>
        <value caption="PLLA clock frequency is divided by 2." name="DIV2" value="1"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK/PLLADIV2 is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK_CLK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLOCK" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLOCK_DIV2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLOCK_DIV4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLOCK_DIV8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLOCK_DIV16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLOCK_DIV32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLOCK_DIV64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK/PLLADIV2 is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK_CLK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLOCK" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLOCK_DIV2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLOCK_DIV4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLOCK_DIV8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLOCK_DIV16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLOCK_DIV32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLOCK_DIV64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK/PLLADIV2 is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK_CLK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLOCK" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLOCK_DIV2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLOCK_DIV4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLOCK_DIV8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLOCK_DIV16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLOCK_DIV32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLOCK_DIV64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCR__DIV">
        <value caption="Peripheral clock is MCK" name="PERIPH_DIV_MCK" value="0x0"/>
        <value caption="Peripheral clock is MCK/2" name="PERIPH_DIV2_MCK" value="0x1"/>
        <value caption="Peripheral clock is MCK/4" name="PERIPH_DIV4_MCK" value="0x2"/>
        <value caption="Peripheral clock is MCK/8" name="PERIPH_DIV8_MCK" value="0x3"/>
      </value-group>
    </module>
