MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
      <value-group caption="" name="PWM_CMR3__CPRE">
        <value caption="Master clock" name="MCK" value="0x0"/>
        <value caption="Master clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Master clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Master clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Master clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Master clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Master clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Master clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Master clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Master clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Master clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
    </module>
    <module caption="Reset Controller" name="RSTC" version="6098I">
      <register-group name="RSTC">
        <register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="Peripheral Reset" mask="0x00000004" name="PERRST"/>
          <bitfield caption="External Reset" mask="0x00000008" name="EXTRST"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY"/>
        </register>
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status" mask="0x00000001" name="URSTS"/>
          <bitfield caption="Reset Type" mask="0x00000700" name="RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="External Reset Length" mask="0x00000F00" name="ERSTL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY"/>
        </register>
      </register-group>
    </module>
    <module caption="Real-time Clock" name="RTC" version="6056I">
      <register-group name="RTC">
        <register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Current Second" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Current Minute" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Current Hour" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" name="AMPM"/>
        </register>
        <register caption="Calendar Register" name="RTC_CALR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Current Century" mask="0x0000007F" name="CENT"/>
          <bitfield caption="Current Year" mask="0x0000FF00" name="YEAR"/>
          <bitfield caption="Current Month" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Current Day in Current Week" mask="0x00E00000" name="DAY"/>
          <bitfield caption="Current Day in Current Month" mask="0x3F000000" name="DATE"/>
        </register>
        <register caption="Time Alarm Register" name="RTC_TIMALR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Second Alarm" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Second Alarm Enable" mask="0x00000080" name="SECEN"/>
          <bitfield caption="Minute Alarm" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Minute Alarm Enable" mask="0x00008000" name="MINEN"/>
          <bitfield caption="Hour Alarm" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="AM/PM Indicator" mask="0x00400000" name="AMPM"/>
          <bitfield caption="Hour Alarm Enable" mask="0x00800000" name="HOUREN"/>
        </register>
        <register caption="Calendar Alarm Register" name="RTC_CALALR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Month Alarm" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Month Alarm Enable" mask="0x00800000" name="MTHEN"/>
          <bitfield caption="Date Alarm" mask="0x3F000000" name="DATE"/>
          <bitfield caption="Date Alarm Enable" mask="0x80000000" name="DATEEN"/>
        </register>
        <register caption="Status Register" name="RTC_SR" offset="0x18" rw="R" size="4">
          <bitfield caption="Acknowledge for Update" mask="0x00000001" name="ACKUPD"/>
          <bitfield caption="Alarm Flag" mask="0x00000002" name="ALARM"/>
          <bitfield caption="Second Event" mask="0x00000004" name="SEC"/>
          <bitfield caption="Time Event" mask="0x00000008" name="TIMEV"/>
          <bitfield caption="Calendar Event" mask="0x00000010" name="CALEV"/>
        </register>
        <register caption="Status Clear Command Register" name="RTC_SCCR" offset="0x1C" rw="W" size="4">
          <bitfield caption="Acknowledge Clear" mask="0x00000001" name="ACKCLR"/>
          <bitfield caption="Alarm Clear" mask="0x00000002" name="ALRCLR"/>
          <bitfield caption="Second Clear" mask="0x00000004" name="SECCLR"/>
          <bitfield caption="Time Clear" mask="0x00000008" name="TIMCLR"/>
          <bitfield caption="Calendar Clear" mask="0x00000010" name="CALCLR"/>
        </register>
        <register caption="Interrupt Enable Register" name="RTC_IER" offset="0x20" rw="W" size="4">
          <bitfield caption="Acknowledge Update Interrupt Enable" mask="0x00000001" name="ACKEN"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00000002" name="ALREN"/>
          <bitfield caption="Second Event Interrupt Enable" mask="0x00000004" name="SECEN"/>
          <bitfield caption="Time Event Interrupt Enable" mask="0x00000008" name="TIMEN"/>
          <bitfield caption="Calendar Event Interrupt Enable" mask="0x00000010" name="CALEN"/>
        </register>
        <register caption="Interrupt Disable Register" name="RTC_IDR" offset="0x24" rw="W" size="4">
          <bitfield caption="Acknowledge Update Interrupt Disable" mask="0x00000001" name="ACKDIS"/>
          <bitfield caption="Alarm Interrupt Disable" mask="0x00000002" name="ALRDIS"/>
          <bitfield caption="Second Event Interrupt Disable" mask="0x00000004" name="SECDIS"/>
          <bitfield caption="Time Event Interrupt Disable" mask="0x00000008" name="TIMDIS"/>
          <bitfield caption="Calendar Event Interrupt Disable" mask="0x00000010" name="CALDIS"/>
        </register>
        <register caption="Interrupt Mask Register" name="RTC_IMR" offset="0x28" rw="R" size="4">
          <bitfield caption="Acknowledge Update Interrupt Mask" mask="0x00000001" name="ACK"/>
          <bitfield caption="Alarm Interrupt Mask" mask="0x00000002" name="ALR"/>
          <bitfield caption="Second Event Interrupt Mask" mask="0x00000004" name="SEC"/>
          <bitfield caption="Time Event Interrupt Mask" mask="0x00000008" name="TIM"/>
          <bitfield caption="Calendar Event Interrupt Mask" mask="0x00000010" name="CAL"/>
        </register>
        <register caption="Valid Entry Register" name="RTC_VER" offset="0x2C" rw="R" size="4">
          <bitfield caption="Non-valid Time" mask="0x00000001" name="NVTIM"/>
          <bitfield caption="Non-valid Calendar" mask="0x00000002" name="NVCAL"/>
          <bitfield caption="Non-valid Time Alarm" mask="0x00000004" name="NVTIMALR"/>
          <bitfield caption="Non-valid Calendar Alarm" mask="0x00000008" name="NVCALALR"/>
        </register>
      </register-group>
      <value-group caption="" name="RTC_CR__TIMEVSEL">
        <value caption="Minute change" name="MINUTE" value="0x0"/>
        <value caption="Hour change" name="HOUR" value="0x1"/>
        <value caption="Every day at midnight" name="MIDNIGHT" value="0x2"/>
        <value caption="Every day at noon" name="NOON" value="0x3"/>
      </value-group>
