MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="PMECC Interrupt Status Register" name="SMC_PMECCISR" offset="0x98" rw="R" size="4">
          <bitfield caption="Error Interrupt Status Register" mask="0x000000FF" name="ERRIS"/>
        </register>
        <register caption="PMECC Redundancy 0 Register (sec_num = 0)" name="SMC_PMECC0_0" offset="0xB0" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 1 Register (sec_num = 0)" name="SMC_PMECC1_0" offset="0xB4" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 2 Register (sec_num = 0)" name="SMC_PMECC2_0" offset="0xB8" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 3 Register (sec_num = 0)" name="SMC_PMECC3_0" offset="0xBC" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 4 Register (sec_num = 0)" name="SMC_PMECC4_0" offset="0xC0" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 5 Register (sec_num = 0)" name="SMC_PMECC5_0" offset="0xC4" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 6 Register (sec_num = 0)" name="SMC_PMECC6_0" offset="0xC8" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 7 Register (sec_num = 0)" name="SMC_PMECC7_0" offset="0xCC" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 8 Register (sec_num = 0)" name="SMC_PMECC8_0" offset="0xD0" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 9 Register (sec_num = 0)" name="SMC_PMECC9_0" offset="0xD4" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 10 Register (sec_num = 0)" name="SMC_PMECC10_0" offset="0xD8" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 0 Register (sec_num = 1)" name="SMC_PMECC0_1" offset="0xF0" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 1 Register (sec_num = 1)" name="SMC_PMECC1_1" offset="0xF4" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 2 Register (sec_num = 1)" name="SMC_PMECC2_1" offset="0xF8" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 3 Register (sec_num = 1)" name="SMC_PMECC3_1" offset="0xFC" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 4 Register (sec_num = 1)" name="SMC_PMECC4_1" offset="0x100" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 5 Register (sec_num = 1)" name="SMC_PMECC5_1" offset="0x104" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 6 Register (sec_num = 1)" name="SMC_PMECC6_1" offset="0x108" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 7 Register (sec_num = 1)" name="SMC_PMECC7_1" offset="0x10C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 8 Register (sec_num = 1)" name="SMC_PMECC8_1" offset="0x110" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 9 Register (sec_num = 1)" name="SMC_PMECC9_1" offset="0x114" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 10 Register (sec_num = 1)" name="SMC_PMECC10_1" offset="0x118" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 0 Register (sec_num = 2)" name="SMC_PMECC0_2" offset="0x130" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 1 Register (sec_num = 2)" name="SMC_PMECC1_2" offset="0x134" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 2 Register (sec_num = 2)" name="SMC_PMECC2_2" offset="0x138" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 3 Register (sec_num = 2)" name="SMC_PMECC3_2" offset="0x13C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 4 Register (sec_num = 2)" name="SMC_PMECC4_2" offset="0x140" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 5 Register (sec_num = 2)" name="SMC_PMECC5_2" offset="0x144" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
