MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="PMECC Redundancy 6 Register (sec_num = 2)" name="SMC_PMECC6_2" offset="0x148" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 7 Register (sec_num = 2)" name="SMC_PMECC7_2" offset="0x14C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 8 Register (sec_num = 2)" name="SMC_PMECC8_2" offset="0x150" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 9 Register (sec_num = 2)" name="SMC_PMECC9_2" offset="0x154" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 10 Register (sec_num = 2)" name="SMC_PMECC10_2" offset="0x158" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 0 Register (sec_num = 3)" name="SMC_PMECC0_3" offset="0x170" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 1 Register (sec_num = 3)" name="SMC_PMECC1_3" offset="0x174" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 2 Register (sec_num = 3)" name="SMC_PMECC2_3" offset="0x178" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 3 Register (sec_num = 3)" name="SMC_PMECC3_3" offset="0x17C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 4 Register (sec_num = 3)" name="SMC_PMECC4_3" offset="0x180" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 5 Register (sec_num = 3)" name="SMC_PMECC5_3" offset="0x184" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 6 Register (sec_num = 3)" name="SMC_PMECC6_3" offset="0x188" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 7 Register (sec_num = 3)" name="SMC_PMECC7_3" offset="0x18C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 8 Register (sec_num = 3)" name="SMC_PMECC8_3" offset="0x190" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 9 Register (sec_num = 3)" name="SMC_PMECC9_3" offset="0x194" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 10 Register (sec_num = 3)" name="SMC_PMECC10_3" offset="0x198" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 0 Register (sec_num = 4)" name="SMC_PMECC0_4" offset="0x1B0" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 1 Register (sec_num = 4)" name="SMC_PMECC1_4" offset="0x1B4" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 2 Register (sec_num = 4)" name="SMC_PMECC2_4" offset="0x1B8" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 3 Register (sec_num = 4)" name="SMC_PMECC3_4" offset="0x1BC" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 4 Register (sec_num = 4)" name="SMC_PMECC4_4" offset="0x1C0" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 5 Register (sec_num = 4)" name="SMC_PMECC5_4" offset="0x1C4" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 6 Register (sec_num = 4)" name="SMC_PMECC6_4" offset="0x1C8" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 7 Register (sec_num = 4)" name="SMC_PMECC7_4" offset="0x1CC" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 8 Register (sec_num = 4)" name="SMC_PMECC8_4" offset="0x1D0" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 9 Register (sec_num = 4)" name="SMC_PMECC9_4" offset="0x1D4" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 10 Register (sec_num = 4)" name="SMC_PMECC10_4" offset="0x1D8" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 0 Register (sec_num = 5)" name="SMC_PMECC0_5" offset="0x1F0" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 1 Register (sec_num = 5)" name="SMC_PMECC1_5" offset="0x1F4" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 2 Register (sec_num = 5)" name="SMC_PMECC2_5" offset="0x1F8" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 3 Register (sec_num = 5)" name="SMC_PMECC3_5" offset="0x1FC" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 4 Register (sec_num = 5)" name="SMC_PMECC4_5" offset="0x200" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 5 Register (sec_num = 5)" name="SMC_PMECC5_5" offset="0x204" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
