MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="PMECC Remainder 10 Register (sec_num = 7)" name="SMC_REM10_7" offset="0x498" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 11 Register (sec_num = 7)" name="SMC_REM11_7" offset="0x49C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Error Location Configuration Register" name="SMC_ELCFG" offset="0x500" rw="RW" size="4">
          <bitfield caption="Sector Size" mask="0x00000001" name="SECTORSZ"/>
          <bitfield caption="Number of Errors" mask="0x001F0000" name="ERRNUM"/>
        </register>
        <register caption="PMECC Error Location Primitive Register" name="SMC_ELPRIM" offset="0x504" rw="R" size="4">
          <bitfield caption="Primitive Polynomial" mask="0x0000FFFF" name="PRIMITIV"/>
        </register>
        <register caption="PMECC Error Location Enable Register" name="SMC_ELEN" offset="0x508" rw="W" size="4">
          <bitfield caption="Error Location Enable" mask="0x00003FFF" name="ENINIT"/>
        </register>
        <register caption="PMECC Error Location Disable Register" name="SMC_ELDIS" offset="0x50C" rw="W" size="4">
          <bitfield caption="Disable Error Location Engine" mask="0x00000001" name="DIS"/>
        </register>
        <register caption="PMECC Error Location Status Register" name="SMC_ELSR" offset="0x510" rw="R" size="4">
          <bitfield caption="Error Location Engine Busy" mask="0x00000001" name="BUSY"/>
        </register>
        <register caption="PMECC Error Location Interrupt Enable register" name="SMC_ELIER" offset="0x514" rw="W" size="4">
          <bitfield caption="Computation Terminated Interrupt Enable" mask="0x00000001" name="DONE"/>
        </register>
        <register caption="PMECC Error Location Interrupt Disable Register" name="SMC_ELIDR" offset="0x518" rw="W" size="4">
          <bitfield caption="Computation Terminated Interrupt Disable" mask="0x00000001" name="DONE"/>
        </register>
        <register caption="PMECC Error Location Interrupt Mask Register" name="SMC_ELIMR" offset="0x51C" rw="R" size="4">
          <bitfield caption="Computation Terminated Interrupt Mask" mask="0x00000001" name="DONE"/>
        </register>
        <register caption="PMECC Error Location Interrupt Status Register" name="SMC_ELISR" offset="0x520" rw="R" size="4">
          <bitfield caption="Computation Terminated Interrupt Status" mask="0x00000001" name="DONE"/>
          <bitfield caption="Error Counter value" mask="0x00001F00" name="ERR_CNT"/>
        </register>
        <register caption="PMECC Error Location SIGMA 0 Register" name="SMC_SIGMA0" offset="0x528" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA0"/>
        </register>
        <register caption="PMECC Error Location SIGMA 1 Register" name="SMC_SIGMA1" offset="0x52C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA1"/>
        </register>
        <register caption="PMECC Error Location SIGMA 2 Register" name="SMC_SIGMA2" offset="0x530" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA2"/>
        </register>
        <register caption="PMECC Error Location SIGMA 3 Register" name="SMC_SIGMA3" offset="0x534" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA3"/>
        </register>
        <register caption="PMECC Error Location SIGMA 4 Register" name="SMC_SIGMA4" offset="0x538" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA4"/>
        </register>
        <register caption="PMECC Error Location SIGMA 5 Register" name="SMC_SIGMA5" offset="0x53C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA5"/>
        </register>
        <register caption="PMECC Error Location SIGMA 6 Register" name="SMC_SIGMA6" offset="0x540" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA6"/>
        </register>
        <register caption="PMECC Error Location SIGMA 7 Register" name="SMC_SIGMA7" offset="0x544" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA7"/>
        </register>
        <register caption="PMECC Error Location SIGMA 8 Register" name="SMC_SIGMA8" offset="0x548" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA8"/>
        </register>
        <register caption="PMECC Error Location SIGMA 9 Register" name="SMC_SIGMA9" offset="0x54C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA9"/>
        </register>
        <register caption="PMECC Error Location SIGMA 10 Register" name="SMC_SIGMA10" offset="0x550" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA10"/>
        </register>
        <register caption="PMECC Error Location SIGMA 11 Register" name="SMC_SIGMA11" offset="0x554" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA11"/>
        </register>
        <register caption="PMECC Error Location SIGMA 12 Register" name="SMC_SIGMA12" offset="0x558" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA12"/>
        </register>
        <register caption="PMECC Error Location SIGMA 13 Register" name="SMC_SIGMA13" offset="0x55C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA13"/>
        </register>
        <register caption="PMECC Error Location SIGMA 14 Register" name="SMC_SIGMA14" offset="0x560" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial." mask="0x00003FFF" name="SIGMA14"/>
        </register>
