MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
        <register caption="Register AB (channel = 2)" name="TC_RAB2" offset="0x8C" rw="R" size="4">
          <bitfield caption="Register A or Register B" mask="0xFFFFFFFF" name="RAB"/>
        </register>
        <register caption="Counter Value (channel = 2)" name="TC_CV2" offset="0x90" rw="R" size="4">
          <bitfield caption="Counter Value" mask="0xFFFFFFFF" name="CV"/>
        </register>
        <register caption="Register A (channel = 2)" name="TC_RA2" offset="0x94" rw="RW" size="4">
          <bitfield caption="Register A" mask="0xFFFFFFFF" name="RA"/>
        </register>
        <register caption="Register B (channel = 2)" name="TC_RB2" offset="0x98" rw="RW" size="4">
          <bitfield caption="Register B" mask="0xFFFFFFFF" name="RB"/>
        </register>
        <register caption="Register C (channel = 2)" name="TC_RC2" offset="0x9C" rw="RW" size="4">
          <bitfield caption="Register C" mask="0xFFFFFFFF" name="RC"/>
        </register>
        <register caption="Status Register (channel = 2)" name="TC_SR2" offset="0xA0" rw="R" size="4">
          <bitfield caption="Counter Overflow Status" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun Status" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare Status" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare Status" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare Status" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading Status" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading Status" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger Status" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
          <bitfield caption="TIOA Mirror" mask="0x00020000" name="MTIOA"/>
          <bitfield caption="TIOB Mirror" mask="0x00040000" name="MTIOB"/>
        </register>
        <register caption="Interrupt Enable Register (channel = 2)" name="TC_IER2" offset="0xA4" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Disable Register (channel = 2)" name="TC_IDR2" offset="0xA8" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Mask Register (channel = 2)" name="TC_IMR2" offset="0xAC" rw="R" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Block Control Register" name="TC_BCR" offset="0xC0" rw="W" size="4">
          <bitfield caption="Synchro Command" mask="0x00000001" name="SYNC"/>
        </register>
        <register caption="Block Mode Register" name="TC_BMR" offset="0xC4" rw="RW" size="4">
          <bitfield caption="External Clock Signal 0 Selection" mask="0x00000003" name="TC0XC0S" values="TC_BMR__TC0XC0S"/>
          <bitfield caption="External Clock Signal 1 Selection" mask="0x0000000C" name="TC1XC1S" values="TC_BMR__TC1XC1S"/>
          <bitfield caption="External Clock Signal 2 Selection" mask="0x00000030" name="TC2XC2S" values="TC_BMR__TC2XC2S"/>
        </register>
      </register-group>
      <value-group caption="" name="TC_CMR0__TCCLKS">
        <value caption="Clock selected: TCLK1" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: TCLK2" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: TCLK3" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: TCLK4" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: TCLK5" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
