MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D34.atdf
      <value-group caption="" name="TC_CMR0__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__TCCLKS">
        <value caption="Clock selected: TCLK1" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: TCLK2" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: TCLK3" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: TCLK4" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: TCLK5" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__TCCLKS">
        <value caption="Clock selected: TCLK1" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: TCLK2" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: TCLK3" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: TCLK4" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: TCLK5" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC0XC0S">
        <value caption="Signal connected to XC0: TCLK0" name="TCLK0" value="0x0"/>
        <value caption="Signal connected to XC0: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC0: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC1XC1S">
        <value caption="Signal connected to XC1: TCLK1" name="TCLK1" value="0x0"/>
        <value caption="Signal connected to XC1: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC1: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC2XC2S">
        <value caption="Signal connected to XC2: TCLK2" name="TCLK2" value="0x0"/>
        <value caption="Signal connected to XC2: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC2: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
    </module>
    <module caption="True Random Number Generator" name="TRNG" version="6334B">
      <register-group name="TRNG">
        <register caption="Control Register" name="TRNG_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Enables the TRNG to provide random values" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Security Key" mask="0xFFFFFF00" name="KEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="TRNG_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Disable Register" name="TRNG_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
        </register>
